nxp-mcuxpresso/mcux-sdk/components/power_manager/devices/MIMXRT1171/fsl_pm_device.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_PM_DEVICE_H_
#define _FSL_PM_DEVICE_H_

#include "fsl_common.h"

#include "fsl_pm_config.h"

/*!
 * @addtogroup PM Framework: Power Manager Framework
 * @brief This section includes Power Mode macros, System Constraints macros, and Wakeup source macros.
 * @{
 */

/*!
 * @name Power Mode Definition
 * @{
 */
#define PM_LP_STATE_SP0  (0U)  /*!< Low power state 0, setpoint 0. */
#define PM_LP_STATE_SP1  (1U)  /*!< Low power state 1, setpoint 1. */
#define PM_LP_STATE_SP2  (2U)  /*!< Low power state 2, setpoint 2. */
#define PM_LP_STATE_SP3  (3U)  /*!< Low power state 3, setpoint 3. */
#define PM_LP_STATE_SP4  (4U)  /*!< Low power state 4, setpoint 4. */
#define PM_LP_STATE_SP5  (5U)  /*!< Low power state 5, setpoint 5. */
#define PM_LP_STATE_SP6  (6U)  /*!< Low power state 6, setpoint 6. */
#define PM_LP_STATE_SP7  (7U)  /*!< Low power state 7, setpoint 7. */
#define PM_LP_STATE_SP8  (8U)  /*!< Low power state 8, setpoint 8. */
#define PM_LP_STATE_SP9  (9U)  /*!< Low power state 9, setpoint 9. */
#define PM_LP_STATE_SP10 (10U) /*!< Low power state 10, setpoint 10. */
#define PM_LP_STATE_SP11 (11U) /*!< Low power state 11, setpoint 11. */
#define PM_LP_STATE_SP12 (12U) /*!< Low power state 12, setpoint 12. */
#define PM_LP_STATE_SP13 (13U) /*!< Low power state 13, setpoint 13. */
#define PM_LP_STATE_SP14 (14U) /*!< Low power state 14, setpoint 14. */
#define PM_LP_STATE_SP15 (15U) /*!< Low power state 15, setpoint 15. */
#define PM_LP_STATE_SNVS (16U) /*!< Low power state 16, SNVS. */

#define PM_LP_STATE_NO_CONSTRAINT (0xFFU)

/*! @} */

/*!
 * @brief List  of system basic resources that controlled by PM.
 */
enum _resc_name
{
    /* Controlled by GPC_CMC. */
    kResc_CPU_PLATFORM = 0U, /*!< CPU platform, this resource is suitable for CM7 and CM4. */

    /* Controlled by CCM. */
    kResc_OSC_RC_16M      = 1U,  /*!< Clock Source: 16MHz RC OSC output. */
    kResc_OSC_RC_48M      = 2U,  /*!< Clock Source: 48MHz RC OSC output. */
    kResc_OSC_RC_48M_DIV2 = 3U,  /*!< Clock Source: 48MHz divided by 2 clock output. */
    kResc_OSC_RC_400M     = 4U,  /*!< Clock Source: 400MHz RC OSC output. */
    kResc_OSC_24M         = 5U,  /*!< Clock Source: VCO, not connect to the clock tree. */
    kResc_OSC_24M_CLK     = 6U,  /*!< Clock Source: 24MHz main output clock. */
    kResc_ARM_PLL         = 7U,  /*!< Clock Source: VCO, not connect to the clock tree. */
    kResc_ARM_PLL_CLK     = 8U,  /*!< Clock Source: ARM PLL main output clock. */
    kResc_SYS_PLL2        = 9U,  /*!< Clock Source: VCO, not connect to the clock tree. */
    kResc_SYS_PLL2_CLK    = 10U, /*!< Clock Source: System PLL2 main output clock. */
    kResc_SYS_PLL2_PFD0   = 11U, /*!< Clock Source: System PLL2 PFD0 clock. */
    kResc_SYS_PLL2_PFD1   = 12U, /*!< Clock Source: System PLL2 PFD1 clock. */
    kResc_SYS_PLL2_PFD2   = 13U, /*!< Clock Source: System PLL2 PFD2 clock. */
    kResc_SYS_PLL2_PFD3   = 14U, /*!< Clock Source: System PLL2 PFD3 clock. */
    kResc_SYS_PLL3        = 15U, /*!< Clock Source: VCO, not connect to the clock tree. */
    kResc_SYS_PLL3_CLK    = 16U, /*!< Clock Source: System PLL3 main output */
    kResc_SYS_PLL3_DIV2   = 17U, /*!< Clock Source: System PLL3 divided by 2 clock. */
    kResc_SYS_PLL3_PFD0   = 18U, /*!< Clock Source: System PLL3 PFD0 clock. */
    kResc_SYS_PLL3_PFD1   = 19U, /*!< Clock Source: System PLL3 PFD1 clock. */
    kResc_SYS_PLL3_PFD2   = 20U, /*!< Clock Source: System PLL3 PFD2 clock. */
    kResc_SYS_PLL3_PFD3   = 21U, /*!< Clock Source: System PLL3 PFD3 clock. */
    kResc_SYS_PLL1        = 22U, /*!< Clock Source: VCO, not connect to the clock tree. */
    kResc_SYS_PLL1_CLK    = 23U, /*!< Clock Source: System PLL1 main clock output. */
    kResc_SYS_PLL1_DIV2   = 24U, /*!< Clock Source: System PLL1 divided by 2 clock. */
    kResc_SYS_PLL1_DIV5   = 25U, /*!< Clock Source: System PLL1 divided by 5 clock. */
    kResc_AUDIO_PLL       = 26U, /*!< Clock Source: VCO, not connect to the clock tree. */
    kResc_AUDIO_PLL_CLK   = 27U, /*!< Clock Source: Audio PLL main clock output. */
    kResc_VIDEO_PLL       = 28U, /*!< Clock Source: VCO, not connect to the clock tree. */
    kResc_VIDEO_PLL_CLK   = 29U, /*!< Clock Source: Video PLL main clock outout. */

    /* Controlled by PGMC_BPC. */
    kResc_MEGA_MIX    = 30U, /*!< Power Domain: MEGA. */
    kResc_DISPLAY_MIX = 31U, /*!< Power Domain: Display. */
    kResc_WAKEUP_MIX  = 32U, /*!< Power Domain: Wakeup. */
    kResc_LPSR_MIX    = 33U, /*!< Power Domain: LPSR. */

    /* Controlled by PMU.  */
    kResc_DCDC         = 34U, /*!< Power supply: DCDC. */
    kResc_LPSR_ANA_LDO = 35U, /*!< Power supply: LPSR ANA LDO. */
    kResc_LPSR_DIG_LDO = 36U, /*!< Power supply: LPSR DIG LDO. */
    kResc_BANDGAP      = 37U, /*!< Internal bandgap. */
    kResc_FBB_M7       = 38U, /*!< Forward body biasing for CM7 platform. */
    kResc_RBB_SOC      = 39U, /*!< Reverse body biasing for Soc
                                  Power domains(MEGA, DISPLAY, WAKEUP, CM7). */
    kResc_RBB_LPSR = 40U,     /*!< Reverse body biasing for LPSR power domain. */

    /* Controlled by GPC_SBC. */
    kResc_STBY_REQ = 41U, /*!< Standby request. */

    kResc_PLL_LDO = 42U,  /*!< Power supply: PLL LDO. */
};

/*!
 * @name System basic resource constraints definitions.
 * @{
 */

/*!
 * @brief Resource constraints definition of CPU platform (suitable for CM7 and CM4 processors), with support for four
 * modes:
 *   1. The CPU domain is in run mode, core is active and cache, TCM, and peripherals inside the CPU platform can be
 * accessed when needed, as specified in @ref PM_CORE_DOMAIN_RUN;
 *   2. The CPU domain is in wait mode, clocks to the CPU core and cache are gated off, as specified in @ref
 * PM_CORE_DOMAIN_WAIT;
 *   3. The CPU domain is in stop mode, clocks to the CPU core, cache, and TCM are gated off, as specified in @ref
 * PM_CORE_DOMAIN_STOP;
 *   4. The CPU platform is powered off, as specified in @ref PM_CORE_DOMAIN_SUSPEND.
 */
#define PM_RESC_CORE_DOMAIN_RUN     PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_CPU_PLATFORM)
#define PM_RESC_CORE_DOMAIN_WAIT    PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_CPU_PLATFORM)
#define PM_RESC_CORE_DOMAIN_STOP    PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON2, kResc_CPU_PLATFORM)
#define PM_RESC_CORE_DOMAIN_SUSPEND PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_CPU_PLATFORM)

/*!
 * @brief Resource constraints definition of OSC_RC_16M, with support for 2 modes:
 *    1. OSC_RC_16M is disabled in low power state, as specified in @ref PM_OSC_RC_16M_OFF;
 *    2. OSC_RC_16M is enabled in low power state, as specificed in @ref PM_OSC_RC_16M_ON.
 */
#define PM_RESC_OSC_RC_16M_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_OSC_RC_16M)
#define PM_RESC_OSC_RC_16M_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_OSC_RC_16M)

/*!
 * @brief Resource constraints definition of OSC_RC_48M, with support for 2 modes:
 *    1. OSC_RC_48M is disabled in low power state, as specified in @ref PM_OSC_RC_48M_OFF;
 *    2. OSC_RC_48M is enabled in low power state, as specified in @ref PM_OSC_RC_48M_ON.
 */
#define PM_RESC_OSC_RC_48M_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_OSC_RC_48M)
#define PM_RESC_OSC_RC_48M_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_OSC_RC_48M)

/*!
 * @brief Resource constraints definition of OSC_RC_48M_DIV2, with support for 2 modes:
 *    1. OSC_RC_48M_DIV2 is disabled in low power state, as specified in @ref PM_OSC_RC_48M_DIV2_OFF;
 *    2. OSC_RC_48M_DIV2 is enabled in low power state, as specified in @ref PM_OSC_RC_48M_DIV2_ON.
 */
#define PM_RESC_OSC_RC_48M_DIV2_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_OSC_RC_48M_DIV2)
#define PM_RESC_OSC_RC_48M_DIV2_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_OSC_RC_48M_DIV2)

/*!
 * @brief Resource constraints definition of OSC_RC_400M, with support for 2 modes:
 *    1. OSC_RC_400M is disabled in low power state, as specified in @ref PM_OSC_RC_400M_OFF;
 *    2. OSC_RC_400M is enabled in low power state, as specified in @ref PM_OSC_RC_400M_ON.
 */
#define PM_RESC_OSC_RC_400M_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_OSC_RC_400M)
#define PM_RESC_OSC_RC_400M_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_OSC_RC_400M)

/*!
 * @brief Resource constraints definition of OSC_RC_24M, with support for 2 modes:
 *    1. OSC_RC_24M is disabled in low power state, as specified in @ref PM_OSC_RC_24M_OFF;
 *    2. OSC_RC_24M is enabled in low power state, as specified in @ref PM_OSC_RC_24M_ON.
 */
#define PM_RESC_OSC_RC_24M_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_OSC_24M)
#define PM_RESC_OSC_RC_24M_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_OSC_24M)

/*!
 * @brief Resource constraints definition of OSC_RC_24M_CLK, with support for 2 modes:
 *    1. OSC_RC_24M_CLK is disabled in low power state, as specified in @ref PM_OSC_RC_24M_CLK_OFF;
 *    2. OSC_RC_24M_CLK is enabled in low power state, as specified in @ref PM_OSC_RC_24M_CLK_ON.
 */
#define PM_RESC_OSC_RC_24M_CLK_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_OSC_24M_CLK)
#define PM_RESC_OSC_RC_24M_CLK_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_OSC_24M_CLK)

/*!
 * @brief Resource constraints definition of ARM_PLL, with support for 2 modes:
 *    1. ARM_PLL is disabled in low power state, as specified in @ref PM_ARM_PLL_OFF;
 *    2. ARM_PLL is enabled in low power state, as specified in @ref PM_ARM_PLL_ON.
 */
#define PM_RESC_ARM_PLL_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_ARM_PLL)
#define PM_RESC_ARM_PLL_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_ARM_PLL)

/*!
 * @brief Resource constraints definition of ARM_PLL_CLK, with support for 2 modes:
 *    1. ARM_PLL_CLK is disabled in low power state, as specified in @ref PM_ARM_PLL_CLK_OFF;
 *    2. ARM_PLL_CLK is enabled in low power state, as specified in @ref PM_ARM_PLL_CLK_ON.
 */
#define PM_RESC_ARM_PLL_CLK_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_ARM_PLL_CLK)
#define PM_RESC_ARM_PLL_CLK_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_ARM_PLL_CLK)

/*!
 * @brief Resource constraints definition of SYS_PLL2, with support for 2 modes:
 *    1. SYS_PLL2 is disabled in low power state, as specified in @ref PM_SYS_PLL2_OFF;
 *    2. SYS_PLL2 is enabled in low power state, as specified in @ref PM_SYS_PLL2_ON.
 */
#define PM_RESC_SYS_PLL2_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL2)
#define PM_RESC_SYS_PLL2_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL2)

/*!
 * @brief Resource constraints definition of SYS_PLL2_CLK, with support for 2 modes:
 *    1. SYS_PLL2_CLK is disabled in low power state, as specified in @ref PM_SYS_PLL2_CLK_OFF;
 *    2. SYS_PLL2_CLK is enabled in low power state, as specified in @ref PM_SYS_PLL2_CLK_ON.
 */
#define PM_RESC_SYS_PLL2_CLK_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL2_CLK)
#define PM_RESC_SYS_PLL2_CLK_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL2_CLK)

/*!
 * @brief Resource constraints definition of SYS_PLL2_PFD0, with support for 2 modes:
 *    1. SYS_PLL2_PFD0 is disabled in low power state, as specified in @ref PM_SYS_PLL2_PFD0_OFF;
 *    2. SYS_PLL2_PFD0 is enabled in low power state, as specified in @ref PM_SYS_PLL2_PFD0_ON.
 */
#define PM_RESC_SYS_PLL2_PFD0_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL2_PFD0)
#define PM_RESC_SYS_PLL2_PFD0_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL2_PFD0)

/*!
 * @brief Resource constraints definition of SYS_PLL2_PFD1, with support for 2 modes:
 *    1. SYS_PLL2_PFD1 is disabled in low power state, as specified in @ref PM_SYS_PLL2_PFD1_OFF;
 *    2. SYS_PLL2_PFD1 is enabled in low power state, as specified in @ref PM_SYS_PLL2_PFD1_ON.
 */
#define PM_RESC_SYS_PLL2_PFD1_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL2_PFD1)
#define PM_RESC_SYS_PLL2_PFD1_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL2_PFD1)

/*!
 * @brief Resource constraints definition of SYS_PLL2_PFD2, with support for 2 modes:
 *    1. SYS_PLL2_PFD2 is disabled in low power state, as specified in @ref PM_SYS_PLL2_PFD2_OFF;
 *    2. SYS_PLL2_PFD2 is enabled in low power state, as specified in @ref PM_SYS_PLL2_PFD2_ON.
 */
#define PM_RESC_SYS_PLL2_PFD2_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL2_PFD2)
#define PM_RESC_SYS_PLL2_PFD2_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL2_PFD2)

/*!
 * @brief Resource constraints definition of SYS_PLL2_PFD3, with support for 2 modes:
 *    1. SYS_PLL2_PFD3 is disabled in low power state, as specified in @ref PM_SYS_PLL2_PFD3_OFF;
 *    2. SYS_PLL2_PFD3 is enabled in low power state, as specified in @ref PM_SYS_PLL2_PFD3_ON.
 */
#define PM_RESC_SYS_PLL2_PFD3_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL2_PFD3)
#define PM_RESC_SYS_PLL2_PFD3_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL2_PFD3)

/*!
 * @brief Resource constraints definition of SYS_PLL3, with support for 2 modes:
 *    1. SYS_PLL3 is disabled in low power state, as specified in @ref PM_SYS_PLL3_OFF;
 *    2. SYS_PLL3 is enabled in low power state, as specified in @ref PM_SYS_PLL3_ON.
 */
#define PM_RESC_SYS_PLL3_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL3)
#define PM_RESC_SYS_PLL3_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL3)

/*!
 * @brief Resource constraints definition of SYS_PLL3_CLK, with support for 2 modes:
 *    1. SYS_PLL3_CLK is disabled in low power state, as specified in @ref PM_SYS_PLL3_CLK_OFF;
 *    2. SYS_PLL3_CLK is enabled in low power state, as specified in @ref PM_SYS_PLL3_CLK_ON.
 */
#define PM_RESC_SYS_PLL3_CLK_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL3_CLK)
#define PM_RESC_SYS_PLL3_CLK_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL3_CLK)

/*!
 * @brief Resource constraints definition of SYS_PLL3_DVI2, with support for 2 modes:
 *    1. SYS_PLL3_DVI2 is disabled in low power state, as specified in @ref PM_SYS_PLL3_DVI2_OFF;
 *    2. SYS_PLL3_DVI2 is enabled in low power state, as specified in @ref PM_SYS_PLL3_DVI2_ON.
 */
#define PM_RESC_SYS_PLL3_DVI2_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL3_DIV2)
#define PM_RESC_SYS_PLL3_DVI2_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL3_DIV2)

/*!
 * @brief Resource constraints definition of SYS_PLL3_PFD0, with support for 2 modes:
 *    1. SYS_PLL3_PFD0 is disabled in low power state, as specified in @ref PM_SYS_PLL3_PFD0_OFF;
 *    2. SYS_PLL3_PFD0 is enabled in low power state, as specified in @ref PM_SYS_PLL3_PFD0_ON.
 */
#define PM_RESC_SYS_PLL3_PFD0_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL3_PFD0)
#define PM_RESC_SYS_PLL3_PFD0_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL3_PFD0)

/*!
 * @brief Resource constraints definition of SYS_PLL3_PFD1, with support for 2 modes:
 *    1. SYS_PLL3_PFD1 is disabled in low power state, as specified in @ref PM_SYS_PLL3_PFD1_OFF;
 *    2. SYS_PLL3_PFD1 is enabled in low power state, as specified in @ref PM_SYS_PLL3_PFD1_ON.
 */
#define PM_RESC_SYS_PLL3_PFD1_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL3_PFD1)
#define PM_RESC_SYS_PLL3_PFD1_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL3_PFD1)

/*!
 * @brief Resource constraints definition of SYS_PLL3_PFD2, with support for 2 modes:
 *    1. SYS_PLL3_PFD2 is disabled in low power state, as specified in @ref PM_SYS_PLL3_PFD2_OFF;
 *    2. SYS_PLL3_PFD2 is enabled in low power state, as specified in @ref PM_SYS_PLL3_PFD2_ON.
 */
#define PM_RESC_SYS_PLL3_PFD2_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL3_PFD2)
#define PM_RESC_SYS_PLL3_PFD2_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL3_PFD2)

/*!
 * @brief Resource constraints definition of SYS_PLL3_PFD3, with support for 2 modes:
 *    1. SYS_PLL3_PFD3 is disabled in low power state, as specified in @ref PM_SYS_PLL3_PFD3_OFF;
 *    2. SYS_PLL3_PFD3 is enabled in low power state, as specified in @ref PM_SYS_PLL3_PFD3_ON.
 */
#define PM_RESC_SYS_PLL3_PFD3_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL3_PFD3)
#define PM_RESC_SYS_PLL3_PFD3_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL3_PFD3)

/*!
 * @brief Resource constraints definition of SYS_PLL1, with support for 2 modes:
 *    1. SYS_PLL1 is disabled in low power state, as specified in @ref PM_SYS_PLL1_OFF;
 *    2. SYS_PLL1 is enabled in low power state, as specified in @ref PM_SYS_PLL1_ON.
 */
#define PM_RESC_SYS_PLL1_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL1)
#define PM_RESC_SYS_PLL1_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL1)

/*!
 * @brief Resource constraints definition of SYS_PLL1_CLK, with support for 2 modes:
 *    1. SYS_PLL1_CLK is disabled in low power state, as specified in @ref PM_SYS_PLL1_CLK_OFF;
 *    2. SYS_PLL1_CLK is enabled in low power state, as specified in @ref PM_SYS_PLL1_CLK_ON.
 */
#define PM_RESC_SYS_PLL1_CLK_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL1_CLK)
#define PM_RESC_SYS_PLL1_CLK_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL1_CLK)

/*!
 * @brief Resource constraints definition of SYS_PLL1_DIV2, with support for 2 modes:
 *    1. SYS_PLL1_DIV2 is disabled in low power state, as specified in @ref PM_SYS_PLL1_DIV2_OFF;
 *    2. SYS_PLL1_DIV2 is enabled in low power state, as specified in @ref PM_SYS_PLL1_DIV2_ON.
 */
#define PM_RESC_SYS_PLL1_DIV2_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL1_DIV2)
#define PM_RESC_SYS_PLL1_DIV2_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL1_DIV2)

/*!
 * @brief Resource constraints definition of SYS_PLL1_DIV5, with support for 2 modes:
 *    1. SYS_PLL1_DIV5 is disabled in low power state, as specified in @ref PM_SYS_PLL1_DIV5_OFF;
 *    2. SYS_PLL1_DIV5 is enabled in low power state, as specified in @ref PM_SYS_PLL1_DIV5_ON.
 */
#define PM_RESC_SYS_PLL1_DIV5_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SYS_PLL1_DIV5)
#define PM_RESC_SYS_PLL1_DIV5_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SYS_PLL1_DIV5)

/*!
 * @brief Resource constraints definition of AUDIO_PLL, with support for 2 modes:
 *    1. AUDIO_PLL is disabled in low power state, as specified in @ref PM_AUDIO_PLL_OFF;
 *    2. AUDIO_PLL is enabled in low power state, as specified in @ref PM_AUDIO_PLL_ON.
 */
#define PM_RESC_AUDIO_PLL_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_AUDIO_PLL)
#define PM_RESC_AUDIO_PLL_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_AUDIO_PLL)

/*!
 * @brief Resource constraints definition of AUDIO_PLL_CLK, with support for 2 modes:
 *    1. AUDIO_PLL_CLK is disabled in low power state, as specified in @ref PM_AUDIO_PLL_CLK_OFF;
 *    2. AUDIO_PLL_CLK is enabled in low power state, as specified in @ref PM_AUDIO_PLL_CLK_ON.
 */
#define PM_RESC_AUDIO_PLL_CLK_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_AUDIO_PLL_CLK)
#define PM_RESC_AUDIO_PLL_CLK_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_AUDIO_PLL_CLK)

/*!
 * @brief Resource constraints definition of VIDEO_PLL, with support for 2 modes:
 *    1. VIDEO_PLL is disabled in low power state, as specified in @ref PM_VIDEO_PLL_OFF;
 *    2. VIDEO_PLL is enabled in low power state, as specified in @ref PM_VIDEO_PLL_ON.
 */
#define PM_RESC_VIDEO_PLL_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_VIDEO_PLL)
#define PM_RESC_VIDEO_PLL_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_VIDEO_PLL)

/*!
 * @brief Resource constraints definition of VIDEO_PLL_CLK, with support for 2 modes:
 *    1. VIDEO_PLL_CLK is disabled in low power state, as specified in @ref PM_VIDEO_PLL_CLK_OFF;
 *    2. VIDEO_PLL_CLK is enabled in low power state, as specified in @ref PM_VIDEO_PLL_CLK_ON.
 */
#define PM_RESC_VIDEO_PLL_CLK_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_VIDEO_PLL_CLK)
#define PM_RESC_VIDEO_PLL_CLK_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_VIDEO_PLL_CLK)

/*!
 * @brief Resource constraints definition of MEGA_MIX(contains the connectivity peripherals and audio peripherals, the
 * specific modules include: \b ENET1G , \b ENET , \b ENET QoS, \b uSDHC , \b USB , \b CAAM , \b ASRC , \b MQS ,
 * \b SAI1-3 , \b SPDIF ), with support for 2 modes:
 *     1. MEGA MIX is disabled in low power state, as specified in @ref PM_MEGA_MIX_OFF;
 *     2. MEGA MIX is enabled in low power state, as specified in @ref PM_MEGA_MIX_ON.
 *
 */
#define PM_RESC_MEGA_MIX_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_MEGA_MIX)
#define PM_RESC_MEGA_MIX_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_MEGA_MIX)

/*!
 * @brief Resource constraints definition of DISPLAY MIX(contains the display and graphics peripherals on the chip, the
 * specific modules include: \b GPU2D , \b PXP , \b eLCDIF , \b LCDOFv2 , \b CSI , \b MIPI_CSI2 , \b MIPI_DSI ,
 * \b VIDEO_MUX ), with support for 2 modes:
 *      1. DISPLAY MIX is disabled in low power state, as specified in @ref PM_DISPLAY_MXI_OFF;
 *      2. DISPLAY MIX is enabled in low power state, as specified in @ref PM_DISPLAY_MIX_ON.
 */
#define PM_RESC_DISPLAY_MIX_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_DISPLAY_MIX)
#define PM_RESC_DISPLAY_MXI_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_DISPLAY_MIX)

/*!
 * @brief Resource constraints definition of WAKEUP MIX(contains the memory controllers and analog periperhal on the
 * chip, the specific modules include: \b EWM , \b WDOG1-3 , \b eDMA , \b DMAMUX0 , \b ACMP1-4 , \b LPADC1-2 ,
 * \b ADC_ETC , \b DAC , \b XBAR1-3 , \b KPP , \b IOMUX , \b IOMUX_GPR , \b GPIO1-6 , \b LPUART1-10 , \b MTR ,
 * \b FLEXCAN1-2 , \b QDC1-4 , \b PIT1 , \b AOI1-2 , \b GPT1-6 , \b TMR1-4 , \b FLEXPWM1-4 , \b LPI2C1-4 , \b LPSPI1-4 ,
 * \b FLEXIO1-2 , \b EMVSIM1-2 , \b FLEXSPI1-2 , \b SEMC , \b MECC1-2 , \b XECC , \b IEE ), with support for 2 modes:
 *       1. WAKEUP MIX is disabled in low power state, as specified in @ref PM_WAKEUP_MIX_OFF;
 *       2. WAKEUP MIX is enabled in low power state, as specified in @ref PM_WAKEUP_MIX_ON.
 */
#define PM_RESC_WAKEUP_MIX_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_WAKEUP_MIX)
#define PM_RESC_WAKEUP_MIX_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_WAKEUP_MIX)

/*!
 * @brief Resource constraints definition of LPSR MIX(contains the System control blocks and associated peripherals, the
 * specific modules include: \b GPC , \b PGMC , \b DCDC , \b SRC , \b SSARC , \b PMU , \b TEMPSENSE , \b XTALOSC ,
 * \b CCM , \b OCOTP , \b SNVS_HP , \b KEYMGR , \b WDOG_CM4 , \b IOMUX_SNVS , \b IOMUX_LPSR , \b MU , \b xRDC2 ,
 * \b RDC1-2 , \b SEMA4 , \b SEMA42, \b eDMA , \b DMAMUX1 , \b GPIO7-12 , \b PDM , \b SAI4, \b PIT2 , \b LPUART11-12 ,
 * \b LPSPI5-6 , \b LPI2C5-6 , \b FLEXCAN3 ), with support for 2 modes:
 *      1. LPSR MIX is disabled in low power state, as specificed in @ref PM_LPSR_MIX_OFF;
 *      2. LPSR MIX is enabled in low power state, as specificed in @ref PM_LPSR_MIX_ON.
 */
#define PM_RESC_LPSR_MIX_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_LPSR_MIX)
#define PM_RESC_LPSR_MIX_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_LPSR_MIX)

/*!
 * @brief Resource constraints definition of DCDC, with support for 2 modes:
 *      1. DCDC is diabled in low power state, as specificed in @ref PM_DCDC_OFF;
 *      2. DCDC is enabled in low power state, as specificed in @ref PM_DCDC_ON,
 * \note Only for application that use on-chip DCDC.
 */
#define PM_RESC_DCDC_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_DCDC)
#define PM_RESC_DCDC_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_DCDC)

/*!
 * @brief Resource constraints definition of LPSR ANA LDO, with support for 2 modes:
 *      1. LPSR ANA LDO is disabled in low power state, as specified in @ref PM_LPSR_ANA_LDO_OFF;
 *      2. LPSR ANA LDO is enabled in low power state, as specified in @ref PM_LPSR_ANA_LDO_ON.
 */
#define PM_RESC_LPSR_ANA_LDO_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_LPSR_ANA_LDO)
#define PM_RESC_LPSR_ANA_LDO_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_LPSR_ANA_LDO)

